#Завдання 1
print("Завдання 1")
spisok_1 = {6, 2, 3, 4, 5}
spisok_2 = {4, 2, 5, 6, 7, 8}
print("Cимволи які є в обох рядках: " + str(spisok_1 & spisok_2))

print()
#Завдання 3
print("Завдання 3")
spisok_1 = {6, 2, 3, 4, 5}
spisok_2 = {4, 2, 5, 6, 7, 8}
print("Cписок унікальних значень без повтору: " + str(spisok_1 ^ spisok_2))

print()
#Завдання 5
g = ("Є рядок, в якому зберігаються 1000 слів. Створіть словник "
     "із ключами - унікальними словами та значеннями - кількістю "
     "повторів кожного слова у послідовності.Є рядок, в якому зберігаються 1000 слів. Створіть словник "
     "із ключами - унікальними словами та значеннями - кількістю "
     "повторів кожного слова у послідовності.Є рядок, в якому зберігаються 1000 слів. Створіть словник "
     "із ключами - унікальними словами та значеннями - кількістю "
     "повторів кожного слова у послідовності.")
a = {1:'рядок', 2:'слова', 3:'кожного'}
print(g.count(a[1]),g.count(a[2]),g.count(a[3]), sep = '\n')

print()
#Завдання 6
biblioteka = {"Автор1": {"Твір 1", "Твір 2", "Твір 3"},
              "Автор2": {"Твір 6", "Твір 5", "Твір 4"},
              "Автор3": {"Твір 7", "Твір 8", "Твір 9"}
              }
vubir = input("Oберiть: 1.Автор, 2.Твір, 3.Додати автора та твip: ")
match vubir:
    case '1':
        print("Автор", biblioteka.keys())
    case '2':
        print("Твір", biblioteka.values())
    case '3':
        new_au = input("Виберыть автора: ")
        new_t = input("Виберыть Твір: ")
        biblioteka[new_au] = {new_t}
        print(biblioteka)

